Revit 2027 API
View.GetWorksharingDisplayMode Method
 Gets the current worksharing display mode for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksharingDisplayMode GetWorksharingDisplayMode()
Public Function GetWorksharingDisplayMode As WorksharingDisplayMode
public:
WorksharingDisplayMode GetWorksharingDisplayMode()
member GetWorksharingDisplayMode : unit -> WorksharingDisplayMode
Return Value
WorksharingDisplayMode
 The active worksharing display mode in this view.
Remarks
 Returns "Off" if no worksharing display mode is currently enabled.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace